In [1]:
import numpy as np
import pandas as pd

1. 创建一个表格数据 命名为df,三列数据,分别是姓名 性别 成绩
2. 得到姓名这一列
3. 得到性别和成绩
4. 打印前两行
5. 得到cc的成绩
6. 将john替换成jack
7. 得到lisa和jack的分数          
8. 得到成绩及格的学生姓名
9. 计算男女分布情况
10. 将成绩按照降序排序 得到姓名排名顺序

In [2]:
# data=[['lisa','女',89],
#       ['cc','男',96],
#       ['john','男',45]]
data={'姓名':['lisa','cc','john'],         
      '性别':['女','男','男'],
      '成绩':[89,96,45]}
df=pd.DataFrame(data=data
                ,columns=['姓名','性别','成绩'])
df

     姓名 性别  成绩
0  lisa  女  89
1    cc  男  96
2  john  男  45

In [3]:
df
# 2. 得到姓名这一列
df['姓名']
df.姓名
df.loc[:,'姓名']
df.iloc[:,0]

0    lisa
1      cc
2    john
Name: 姓名, dtype: object

In [39]:
# 3 得到性别和成绩
df[['性别','成绩']]
df.loc[:,['性别','成绩']]
df.iloc[:,[1,2]]
df.iloc[:,1::]

  性别  成绩
0  女  89
1  男  96
2  男  45

In [4]:
# 4. 打印前两行
df.head(2)
df[0:2]
# 这里的1当做标签
df.loc[0:1]
df.iloc[0:2]

     姓名 性别  成绩
0  lisa  女  89
1    cc  男  96

In [5]:
# 5. 得到cc的成绩
df1=df[df['姓名']=='cc']
df1['成绩'].values

array([96], dtype=int64)

In [17]:
# 6. 将john替换成jack
# df['姓名']=df['姓名'].str.replace('john','jack')
# df
df.loc[df['姓名']=='john','姓名']='jack'

In [18]:
df

     姓名 性别  成绩
0  lisa  女  89
1    cc  男  96
2  jack  男  45

In [31]:
# 7. 得到lisa和jack的分数
# df.loc[[0,2],['姓名','成绩']]
# df.iloc[[0,2],[0,2]]
df2=df[df['姓名'].isin(['lisa','jack'])]
df2[['姓名','成绩']]
# 牛客网 力扣 pandas sql

     姓名  成绩
0  lisa  89
2  jack  45

In [35]:
# 8. 得到成绩及格的学生姓名
df.loc[df['成绩']>60,'姓名']

0    lisa
1      cc
Name: 姓名, dtype: object

In [37]:
# 9. 计算男女分布情况
df['性别'].value_counts()

性别
男    2
女    1
Name: count, dtype: int64

In [40]:
# 10. 将成绩按照降序排序 得到姓名排名顺序
df.sort_values(by='成绩',ascending=False)['姓名']

1      cc
0    lisa
2    jack
Name: 姓名, dtype: object

In [7]:
# 3. 得到性别和成绩
df[['性别','成绩']]
df.loc[:,['性别','成绩']]
df.iloc[:,1::]
df.iloc[:,[1,2]]

  性别  成绩
0  女  89
1  男  96
2  男  45